import React, { FC } from 'react'
import classes from '../style/about.module.scss'

const About: FC = (): JSX.Element => {
    return (
        <div className={classes['container']}>
            <h1 className={classes['title']}>
                կենտրոնի մասին
            </h1>
            <div className={classes['section']}>
                <div className={classes['imgdiv']}>
                    <img
                        src="/img/img1.png"
                        alt=""
                        className={classes['img']}
                    />
                </div>
                <div className={classes['anuthing']}>
                    <p className={classes['p']}>
                        կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին կենտրոնի մասին՝ գործունեության ու աշխատանքի մասին 
                    </p>

                </div>
            </div>
        </div>
    )
}

export default About