export const items = [
    {
        id: 1,
        text: "HTLM / CSS",
        content:
            " HTLM և CSS դասընթացը տևում է 1-1.5 ամիս։ HTML-ը ներառում է կայքերի կառուցվածքը: Այն կարող է ներառել տարրեր, որոնք սահմանում են կայքի ոճը, որոնց միջոցով դինամիկ կայքեր են ստեղծվում: CSS-ը (Cascading Style Sheets) ներառում է կայքի ձևավորման ու ձևավորածության հատկությունները: Երբ HTML-ը նկարագրում է կայքի կառուցվածքը (կամ DOM-ը), CSS-ը կարող է սահմանել տարրերի չափսերը, գույները, գուները, գույները, և այլ հավասարաչափ առանձին բարձրություններ::",
    },
    {
        id: 2,
        text: "JavaScript / TypeScript",
        content:
            "JavaScript դասընթացը տևում է 5-6 ամիս։ Այս դասընթացների ընթացքում կսովորեք JavaScript ծրագրավորման լեզուն 0-ից մինչև խորացված մակարդակ: Կձևավորվի Ձեզ մոտ ծրագրավորման գիտելիքների և ունակությունների ամուր հիմք, ինչի շնորհիվ հեշտությամբ կկարողանաք նվաճել ցանկացած բարձունք IT ոլորտում:Ընդհանուր ծրագիրը բաղկացած է 2 փուլից: 1-ին փուլում կսովորեք ծրագրավորման հիմունքները, իսկ 2-րդ փուլում կսովորեք JavaScript ծրագրավորման լեզուն խորացված մակարդակով` OOP: 2-րդ փուլին կարող են անցնել միայն այն ուսանողները, ովքեր բարեհաջող կավարտեն 1-ին փուլը՝ հանձնելով համապատասխան քննություն ձեռք բերված գիտելիքների հիման վրա:Դասընթացների ընթացքում կսովորեք նաև աշխատել HTML5 API-ների հետ:Դասընթացները բարեհաջող ավարտելու դեպքում «վեբ կայքեր պատրաստող» դառնալու փոխարեն կդառնաք ծրագրավորող: Ավելին․ կկարողանաք գտնել աշխատանք որպես JavaScript ծրագրավորող, կկարողանաք նաև ինքնուրույն ուսումնասիրել և կիրառել JavaScript-ին կից տեխնոլոգիաները։Նկատի ունեցեք, որ JS-ն այսօր ամենապահանջված ծրագրավորման լեզուներից մեկն է: Այն կիրառելի է Front-end, Back-end տիրույթներում, մոբայլ հավելվածներում` Apps, հնարավոր է նաև մշակել ML/AI լուծումներ: Մասնակցության համար ցանկալի է ունենալ բազային գիտելիքներ HTML-ից և CSS-ից:  TypeScript լեզուն կարգավորվել է JavaScript-ով։ Ուստի JavaScript ծրագիրը նույնպես համարվում է TypeScript-ի ճիշտ ծրագիր, և TypeScript-ը կարող է արագ ներգրավել JavaScript կոդը։ TypeScript-ը կոմպիլացնում է ES3-ը[5]։TypeScript- ի հետ հնարավոր է օգտագործել JavaScript կոդ, որոնք ներառում են հայտնի գրադարանններ ",
    },
    {
        id: 3,
        text: "React / Next",
        content:
            "Դասընթացների ընթացքում կսովորեք JavaScript-ի ամենատարածված գրադարանը՝ React, ինչի շնորհիվ կկարողանաք մշակել գերարագ աշխատող համակարգ Front-end տիրույթում:Ընթացքում կծանոթանաք JSX-ին և Babel-ին: Կկսովորեք կիրառել նաև այնպիսի տեխնոլոգիաներ, ինչպիսիք են՝ Redux-ը, Gatsby-ն և Next.js-ը։ Վերջինս պետք է գալիս SSR-ի (Server-Side Rendering) համար:Դասընթացները բարեհաջող ավարտելուց հետո կկարողանաք ընդունվել աշխատանքի որպես Front-end ծրագրավորող / React Developer, իսկ մասնակցելու համար անհրաժեշտ է ունենալ բազային գիտելիքներ HTML-ից, CSS-ից և OOP մակարդակի գիտելիքներ JavaScript-ից:",
    },
    {
        id: 4,
        text: "C++",
        content:
            " C++ ֊ը հանդիսանում է հզոր գործիք ծրագրավորման ոլորտում, C++֊ը ունի ընդլայնման լայն հնարավորություն, որի հետևանքով այն լայնորեն օգտագործվում է շատ ռեսուրս պահանջող ծրագրերում՝ օրինակ գրաֆիկական խաղերում. Ահա թե ինչու ամենա հրաշալի 3D խաղերը թվում են թեթև և արագ:  C++֊ը հնարավորություն կտա անել ամեն ինչ, չսահմանափակելով ձեր երևակայությունը: Այն ունի StackOverflow ամենաբարձր պատասխանների ցուցանիշը: Adobe, Amazon, Paypal, Chrome - շատ ուրիշ ծրագրեր ստեղծվել են C++֊ի հիման վրա : Փուլերի Հերթականություն Համակարգչային ճարտարագիտություն և C / C++ ծրագրավորման լեզվի ընդհանուր իմացություն։ OOP (Objcet Oriented Programming): Template: STL  Standard Template Library): Algorithms and Data  tructure: Դասընթացի ընթացքում քննարկվելու են  արցազրույցին հաճախ տրվող հարցեր։ Անցկացվելու են թեստային և ամփոփիչ դասեր։",
    },
    {
        id: 5,
        text: "SMM",
        content:
            "Ձե՛ռք բերեք պահանջված մասնագիտություն 1 ամսում մասնակցելով SMM դասընթացին և սովորե՛ք կատարել բիզնեսի ու անձնական բրենդի առաջխաղացում սոցիալական մեդիայում։ Անհրաժեշտ բոլոր գործիքները, հմտություններն ու գիտելիքները մեկ վայրում։ Մարքեթինգային մտածելակերպի ձևավորում 0-ից պրոյեկտի ստեղծում և առաջխաղացում Տնային առաջադրանքներ և անհատական քննարկում Իրական քեյսերի վրա գործնական աշխատանք FB, IG, TG, In մարքեթինգի գործիքակազմ։ Դասընթացի ընթացքում 0-ից ստեղծելու եք ձեր սեփական նախագիծը և աշխատելու եք դրա առաջխաղացման վրա՝ օգտագործելով BDG-ի կողմից տրամադրվող գովազդային բյուջեն։ ",
    },
];

export const teamMembers = [
    { name: "Արման", role: "Տնօրեն", img: "/staff/Arman.jpeg" },
    { name: "Նարինե", role: "Frontend ծրագրավորող ", img: "/staff/Narine.jpeg" },
    { name: "Գևորգ", role: "Full Stack ծրագրավորող ", img: "/staff/Gevorg.jpg" },
    { name: "Հերմինե", role: "Frontend ծրագրավորող", img: "/staff/Hermine.jpg" }, { name: "Արման", role: "տնօրեն", img: "/staff/Arman.jpeg" },
    { name: "Նարինե", role: "Frontend ծրագրավորող", img: "/staff/Narine.jpeg" },
    { name: "Գևորգ", role: "Full Stack ծրագրավորող ", img: "/staff/Gevorg.jpg" },
    { name: "Հերմինե", role: "Frontend ծրագրավորող", img: "/staff/Hermine.jpg" }
];

export const settings = {
    dots: true,
    infinite: false,
    speed: 500,
    slidesToShow: 4,
    slidesToScroll: 4,
    initialSlide: 0,
    responsive: [
        {
            breakpoint: 1024,
            settings: {
                slidesToShow: 3,
                slidesToScroll: 3,
                infinite: true,
                dots: true,
            },
        },
        {
            breakpoint: 600,
            settings: {
                slidesToShow: 2,
                slidesToScroll: 2,
                initialSlide: 2,
            },
        },
        {
            breakpoint: 480,
            settings: {
                slidesToShow: 1,
                slidesToScroll: 1,
            },
        },
    ],
};

